<h1>運算子</h1>
<h3>一元運算子</h3>

<?php
$a=true;
echo !$a;//!為反向,會回傳為false

$b=1;
echo ++$b;//$b=$b+1
echo '<br>';
echo --$b;//$b=$b-1
echo '<hr>';
?>
<h3>二元運算子</h3>
<?php
$a=10;
$b=100;
echo '比較運算子';
echo '<br>';
echo $a!=$b;//比較運算子相同回傳true反之false(==，!=，>，<=)
echo '<br>';
echo $a.$b;//字串運算子，兩個變數串接起來
echo '<hr>';
?>

<h3>三元運算子</h3>
<h4>交換變數</h4>
<?php
//題目為a=10,b=50,將兩者數值交換,以下

$a=10;
$b=50;
$c=$a;//因為下面的a指派後會變為a=50了,所以要再設一個變數c重新指派為a=10

$a=$b;//兩者要交換數值
$b=$c;

echo 'a='.$a;
echo '<br>';
echo 'b='.$b;

//也可以把32行-37行的直接改為成下面的40-44行,因為無法直接將40行與41行合併
//echo 'a=';
//echo $a=$b;
//echo '<br>';
//echo 'b=';
//echo $b=$c;
?>